<?php

use yii\db\Migration;
/**
 * Class m190405_135836_insert_employee
 */
class m190405_135836_insert_employee extends Migration
{
    public function up()    {

        Yii::$app->db->createCommand()->batchInsert('employee',
                ['name' , 'surname', 'phone', 'position', 'active', 'salary'],
            [
                ['Игорь', 'Иванов', '0000000000', 'Менеджер', '1', '12000'],
                ['Антон', 'Петров', '1111111111', 'Cлесарь', '1', '40000'],
                ['Сергей', 'Семенов', '2222222222', 'Механник', '1', '50000'],
                ['Петр', 'Антонов', '333333333', 'Продавец', '1', '24000'],
                ['Денис', 'Серегин', '4444444444', 'Монтажник', '0', '27000'],
                ['Алексей', 'Иванов', '5555555555', 'Оптимизатор', '1', '10000'],
                ['Иван', 'Алексеев', '6666666666', 'Курьер', '0', '50000'],
                ['Сергей', 'Зельдин', '7777777777', 'Экспедитор', '1', '30000'],
                ['Павел', 'Тихонов', '8888888888', 'Повар', '1', '32000'],
                ['Дмитрий', 'Денисов', '9999999999', 'Официант', '1', '17000'],
                ['Ярослав', 'Проскурин', '1112228899', 'Секретарь', '1', '35000'],

            ]
        )->execute();
    }

    public function down()
    {

    }
}
